In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
s = pd.Series(['Hani','Fahd','Mohamed'],index=[1,2,3])
s

1       Hani
2       Fahd
3    Mohamed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
s.index=[11,12,13]
s

11       Hani
12       Fahd
13    Mohamed
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
s.head(2)

11    Hani
12    Fahd
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [13]:
s1 = pd.Series(['Hani'],index=[14])
s = s.append(s1)
s

11       Hani
12       Fahd
13    Mohamed
14       Hani
dtype: object

In [14]:
s.drop_duplicates()

11       Hani
12       Fahd
13    Mohamed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [16]:
 data = {'ID':['1122','1133','1144','1199'],
        'Name':['Ahmed','Hasan','Fahd','Aziz'],
        'Grade':['A','B','C','C']}
studentdf = pd.DataFrame(data, columns=['ID','Name','Grade'])
studentdf

     ID   Name Grade
0  1122  Ahmed     A
1  1133  Hasan     B
2  1144   Fahd     C
3  1199   Aziz     C

## Q6: Read educ_figdp_1_Data.csv file

In [17]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [18]:

##    loc use the index labels as references
##  slice use the position as references


edu[2:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [19]:
edu.loc[2:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e